In [1]:
import pandas as pd

## Processing & Filering the Dataset

### Course Dataset

In [2]:
course_dataset = pd.read_csv("course_info.csv")
print(course_dataset.shape) #dataset contains 6410 courses with 6 columns each
course_dataset.head()

(6410, 6)

,id,course_id,start,end,course_type,category
0,6561,course-v1:CPVS+CPVS-HDLSC001+20160901,2016-11-16 08:00:00,2016-12-31 23:30:00,0,NaN
1,5557,course-v1:SCUT+144282+201709,2016-09-01 00:00:00,2017-02-28 00:00:00,0,NaN
2,9433,course-v1:ZK+06093+J,2018-01-01 08:00:00,2020-01-01 00:00:00,0,NaN
3,8320,course-v1:nuist+001+2016-T1,2017-03-01 18:30:00,2017-07-01 23:30:00,0,NaN
4,231,FUDAN/CFD004/2014.9-2015.1,2014-09-10 08:00:00,2015-09-10 00:00:00,0,NaN

In [3]:
#check for null values 
course_dataset.isnull().sum() #there are some missing values in the end and category columns

id                0
course_id         0
start             0
end             533
course_type       0
category       4956
dtype: int64

### Analysing the dataset

course_info has 6 columns names id, course_id, start, end, course_type and category.

**id**: the id number of the course

**course_id**: the id string

**start**: course start time

**end**: course end time

**course_type**: course mode (0: instructor-paced course, 1: self-paced course)

**category**: the category of course.

In [7]:
course_dataset["course_type"].value_counts() #5877 courses are instructor paced and 533 are self-paced

0    5877
1     533
Name: course_type, dtype: int64

In [8]:
course_dataset["category"].value_counts()

computer            173
economics           161
engineering         112
art                  95
foreign language     89
business             88
social science       86
history              84
math                 82
philosophy           80
literature           80
physics              72
biology              55
education            54
medicine             52
electrical           46
environment          24
chemistry            21
Name: category, dtype: int64

In [6]:
course_dataset["category"]

0              NaN
1              NaN
2              NaN
3              NaN
4              NaN
           ...
6405           NaN
6406           NaN
6407           NaN
6408    philosophy
6409           NaN
Name: category, Length: 6410, dtype: object

### User Dataset

In [9]:
user_dataset = pd.read_csv("user_info.csv")
print(user_dataset.shape) #dataset contains 9627148 users with 4 columns each
user_dataset.head()

(9627148, 4)

   user_id gender   education   birth
0      631   male        High  1997.0
1     2631   male  Bachelor's  1990.0
2     4231   male   Associate  1991.0
3     6031   male  Bachelor's  1988.0
4     7831    NaN         NaN     NaN

In [10]:
#check for null values 
user_dataset.isnull().sum() #there are missing values in the gender, education and birth columns

user_id            0
gender       8420796
education    9298955
birth        9145726
dtype: int64

### Analysing the dataset

user_info has 4 columns names usesr_id, gender, education and birth date.

**user_id**: the id of user

**gender**:the gender of user

**education**: user's education level

**birth**: user's birth year

In [12]:
user_dataset["gender"].value_counts()

male      669707
female    536645
Name: gender, dtype: int64

In [13]:
user_dataset["education"].value_counts()

Bachelor's    172616
Master's       53988
High           48637
Associate      36955
Doctorate       8252
Middle          6308
Primary         1437
Name: education, dtype: int64

### Data Pre-Processing

In [ ]:
#check this
#https://github.com/ry05/couReco/blob/master/data_preparation.py

In [ ]:
#maybe the coursera data set would be more suitable than the course from this one? I think it could work.